[
  {
    "_id": 1,
    "name": "Men fashion in 2022",
    "content": "If you've come looking for the brashest, bravest men's fashion trends of 2022, you'll find…some of that here. But really, as we've compiled these annual menswear temperature checks year after year, they've transmogrified a little from a report on Capital-T Trends We're Seeing Out In the World to more of a loose assemblage of Stuff We're Kinda Into and Wanna Wear Right Now. Less forecasting, more feelings. Here are the style moves we're making heading into 2022: the throwback jacket we'll be huddling up in all winter; the showstopping trousers we want to hit the dance floor in pronto; the vibey balaclavas that'll keep your ears toasty and your face mask secure. Are these the biggest men's fashion trends 2022 will deliver? Probably not! But they'll keep you looking pretty damn fly while we wait around to find out.",
    "image": "https://i.ibb.co/PD0t8yF/sajad-fi-dqec-Ek-A69-WY-unsplash.jpg",
    "likes": 15,
    "comments": 6,
    "time": "3 minutes",
    "published": "Dec 2 2022",
    "writerName": "Tanvir Hossain Fahim",
    "photo": "https://i.ibb.co/34KW6kM/Tanvir-Hossain-Fahim.png",
    "topics": ["fashion", "men"]
  },
  {
    "_id": 2,
    "name": "Men Haircut in 2022",
    "content": "In this article, I’ll introduce you to the most comprehensive collection of the best hairstyles and haircuts for men ever.The over 200 men’s hairstyles and haircuts presented in this article are from the world’s best barbers and hairstylists, cutting and styling A-class celebrities, so you’re in the best hands. Each haircut is detailed in 4 different pics, so there’s plenty of inspiration for you to choose your style from. The aim of this very comprehensive guide on the best men’s hairstyles in 2022 is to help you find and choose the cut that suits you best and show it to your barber to turn it into a reality. Scroll down to check the most popular haircut pics right now",
    "image": "https://i.ibb.co/sFNgC3q/michael-demoya-Q82-AM6-BWBPM-unsplash.jpg",
    "likes": 10,
    "comments": 3,
    "time": "2 minutes",
    "published": "Nov 22 2022",
    "writerName": "Tanvir ",
    "photo": "https://i.ibb.co/pWr7hCD/Tanvir-Hossain-Fahim.jpg",
    "topics": ["hair cut", "men"]
  },
  {
    "_id": 3,
    "name": "New Hair styles for men",
    "content": "Men’s short hair might be easy to control and maintain, but that doesn’t mean you have to miss out on the style department. On the contrary, there’s a full slate of men’s short hairstyles from which to choose. Within this guide to short haircuts, you’ll discover curly tops, simple undercuts, short side front bangs and so much more.To prove that the possibilities are almost limitless, we’ve compiled a list of more than 50 short hairstyles for men in one place. Each one will keep you on the cutting edge of modern hairstyle, and have you looking downright dashing. From basic boys cuts to fashion-forward perms to everything in between, you’ll find it all below, plus the occasional celebrity cameo. Not sure what look you’re going for? Check out these related hairstyle lists to gain some serious style inspiration.",
    "image": "https://i.ibb.co/ykbMMCD/hair-spies-0-KYSw5-C2-E00-unsplash.jpg",
    "likes": 17,
    "comments": 6,
    "time": "4 minutes",
    "published": "Oc 15 2022",
    "writerName": "Fahim ",
    "photo": "https://i.ibb.co/KhFLZcM/Tanvir-Hossain-Fahim.png",
    "topics": ["hair style", "men"]
  },
  {
    "_id": 4,
    "name": "New fashion accessories for men in 2022",
    "content": "In 2022, new fashion trends have already made their mark — but have you updated your look? These men’s accessories are the perfect way to look fresher than ever. Whether you’ve put maximum effort into curating the perfect capsule wardrobe or you’re a man only interested in of-the-moment styles, the right finishing touches are essential. If you've been following the fashion world, you already know that 2022 is the year to pay homage to Y2k fashion, push boundaries with accessorising like never before — and seek out timeless pieces with modern twists. Read on for more on the trends in men’s accessories that will invigorate your look in bold ways.",
    "image": "https://i.ibb.co/QkRmDNq/andrea-donato-MNu0n-3-BIKs-unsplash.jpg",
    "likes": 22,
    "comments": 9,
    "time": "2 minutes",
    "published": "Oct 5 2022",
    "writerName": "Hossain ",
    "photo": "https://i.ibb.co/D9Jsyzm/Tanvir-Hossain-Fahim.png",
    "topics": ["accessories", "men"]
  }
]
